WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // Set sample time for channels 0-9
  regval = getreg32(STM32_ADC1_SMPR2);
  regval &= 0xc0000000;      // Clear sample time fields 0-9
  regval |= ADC_SMPR2_DEFAULT;
  putreg32(regval, STM32_ADC1_SMPR2);

  //------------------------------------------------------------
  // ADC_SQR1, ADC_SQR2 and ADC_SQR3 are used to configure the sequence of the
  // conversions. If there are no entries then nothing will be converted.
  // Basically, which input is connected to the ADC in which order.
  //
  // The values put in these fields can be found by looking at the target
  // hardware. For the FeatherV2, A00 is PA4. Next look at the Data Sheet
  // 'Table 11. STM32F777xx, STM32F778Ax and STM32F779xx pin and ball
  // definitions.' In the 'Pin name' column find PA4. Then look in the
  // 'Additional functions' column for the possible analog inputs for the ADC
  // being used. In this case there are 2 possible ADC1_IN4, and ADC2_IN4.
  //
  // ADC_SQR3 contains the first 6, ADC_SQR2 the next 6 and ADC_SQR1 the last 4
  // for a total of 16 GPIOs can be connected to ADC1

// 
// THIS DIDN'T FIX THE PROBLEM
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);
  regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
 
  // (--) TESTING MAKE HARDCODE All 6 Pins
  regval |= (4  << ADC_SQR3_SQ1_SHIFT);   // Channel 4  - A00 [PA4]->ADC123_IN4
  regval |= (5  << ADC_SQR3_SQ2_SHIFT);   // Channel 5  - A01 [PA5]->ADC123_IN5
  regval |= (3  << ADC_SQR3_SQ3_SHIFT);   // Channel 3  - A02 [PA3]->ADC123_IN3
  regval |= (8  << ADC_SQR3_SQ4_SHIFT);   // Channel 8  - A03 [PB0]->ADC12_IN8
  regval |= (9  << ADC_SQR3_SQ5_SHIFT);   // Channel 9  - A04 [PB1]->ADC12_IN9
  regval |= (10 << ADC_SQR3_SQ6_SHIFT);   // Channel 10 - A05 [PC0]->ADC123_IN10
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);

// THE FOLLOWING HAS BEEN PARTIAL TESTED - BUT THE ABOVE IS DOING THE WORK
// WHILE TESTING
  // uint32_t adcInputChan;
  // uint32_t seqRegCount;
  // uint32_t remainingCnt = _gpioCount;
  // uint32_t regCnt;

  // // Sequence Register 3 - ADC channels 1-6
  // seqRegCount = MEADOW_ADC_SEQ_3_REGISTER_TOTAL;
  // if(remainingCnt < MEADOW_ADC_SEQ_3_REGISTER_TOTAL)
  //   seqRegCount = remainingCnt;

  // regval = getreg32(STM32_ADC1_SQR3);
  // regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
  // ret = populate_adc_seq_channel(&regval, seqRegCount, ADC_SQR3_SQ1_SHIFT);
  // if(ret < 0)
  //   return ret;    // Error
  // putreg32(regval, STM32_ADC1_SQR3);
  // remainingCnt -= MEADOW_ADC_SEQ_3_REGISTER_TOTAL;

  // // Sequence Register 2 - ADC channels 7-12
  // if(remainingCnt > 0)
  // {
  //   seqRegCount = MEADOW_ADC_SEQ_2_REGISTER_TOTAL;
  //   if(remainingCnt < MEADOW_ADC_SEQ_2_REGISTER_TOTAL)
  //     seqRegCount = remainingCnt;

  //   regval = getreg32(STM32_ADC1_SQR2);
  //   regval &= ADC_SQR2_RESERVED;   // Clear all SQR Bits
  //   ret = populate_adc_seq_channel(&regval, seqRegCount, ADC_SQR2_SQ7_SHIFT);
  //   if(ret < 0)
  //     return ret;    // Error
  //   putreg32(regval, STM32_ADC1_SQR2);
  //   remainingCnt -= MEADOW_ADC_SEQ_2_REGISTER_TOTAL;
  // }
 
  // // Sequence Register 1 - ADC channels (13-16)
  // if(remainingCnt > 0)
  // {
  //   seqRegCount = MEADOW_ADC_SEQ_1_REGISTER_TOTAL;
  //   if(remainingCnt < MEADOW_ADC_SEQ_1_REGISTER_TOTAL)
  //     seqRegCount = remainingCnt;

  //   regval = getreg32(STM32_ADC1_SQR1);
  //   regval &= ADC_SQR1_RESERVED;   // Clear all SQR Bits
  //   ret = populate_adc_seq_channel(&regval, seqRegCount, ADC_SQR1_SQ13_SHIFT);
  //   if(ret < 0)
  //     return ret;    // Error
  //   putreg32(regval, STM32_ADC1_SQR1);
  // }

  // Last set the size
  regval = getreg32(STM32_ADC1_SQR1);
  regval |= ((_gpioCount - 1) << ADC_SQR1_L_SHIFT);
  putreg32(regval, STM32_ADC1_SQR1);

//---------------------------------------------------------
  // (--) WHY NOT WITH OTHER CR2 CONFIGS?
  // Enable DMA of ADC
  regval = getreg32(STM32_ADC1_CR2);
  // DDS may only be for single ADC mode  (may be only when not using sequence???)
  // but comments 15.8.1 ony double buffered circular mode
  regval |= ADC_CR2_DDS;          // 1=Enable DMA Disable Selection
  regval |= ADC_CR2_DMA;          // 1=Enable DMA
  regval |= ADC_CR2_CONT;         // 1=Enable continuous mode
  putreg32(regval, STM32_ADC1_CR2);
}
#else
//======================================================================
// Assumes ADC 1
static void adc_initialize (void)
{
  uint32_t regval;

  // Insure the correct ADC clock is on. If not enabled it was impossible
  // to successfully write values into some ADC configuration registers.
  // (--) NEEDED ?
  regval = getreg32(STM32_RCC_APB2ENR);
  regval |= RCC_APB2ENR_ADC1EN;
  putreg32(regval, STM32_RCC_APB2ENR);

  // Turn-off ADC
  // regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  // regval &= ~ADC_CR2_ADON;      // 0=A/D Converter off (turned on later)
  // putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Set the ADC watchdog high and low threshold to max and min
  putreg32(0x00000fff, STM32_ADC1_BASE + STM32_ADC_HTR_OFFSET);
  putreg32(0x00000000, STM32_ADC1_BASE + STM32_ADC_LTR_OFFSET);

  // Reset all the ADCs via Reset and Clock Control (RCC). For the STM32F7
  // there is a single bit for all ADCs. Other MCUs have a bit for each ADC.
  regval = getreg32(STM32_RCC_APB2RSTR);
  regval |= RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  // (--) PROBABLTY NOT NEEDED
  // // Restore ADC from reset state
  regval = getreg32(STM32_RCC_APB2RSTR);
  regval &= ~RCC_APB2RSTR_ADCRST;
  putreg32(regval, STM32_RCC_APB2RSTR);

  // Now for some ADC work
  //------------------------------------------------------------
  // ADC Common Control Register
  regval = getreg32(STM32_ADC_CCR);
  // regval &= ~ADC_CCR_TSVREFE;       // 0=disable temperature sensor channel
  // regval &= ~ADC_CCR_VBATE;         // 0=disable vbat channel

  // ADCPRE - Calculation based on PCLK2=96MHz (with 192MHz clock). Per Data
  // Sheet 5.3.24 pp 165, max ADC clock is 36MHz. Therefore, divide by 4
  // (96/4=24MHz) is the highest freq. For clock  details see Meadow's board.h
  //? regval &= ~ADC_CCR_ADCPRE_MASK;   // Clear any bits in ADC prescaler
  regval |= ADC_CCR_ADCPRE_DIV4;    // 01=ADC prescaler PCLK2 divided by 4

  // 00: DMA mode disabled
  // 01: DMA mode 1 enabled (2 / 3 half-words one by one - 1 then 2 then 3)
  // 10: DMA mode 2 enabled (2 / 3 half-words by pairs - 2&1 then 1&3 then 3&2)
  // 11: DMA mode 3 enabled (2 / 3 bytes by pairs - 2&1 then 1&3 then 3&2)
  // regval &= ~ADC_CCR_DMA_MASK;       // Clear any bits in DMA mode (multi-ADC mode only) 
  // regval |= ADC_CCR_DMA_DISABLED;    // 00 = DMA Modes (multi-ADC mode only)
  // regval |= (1 << ADC_CCR_DMA_SHIFT) // 01: DMA mode 1 enabled
  // regval |= (2 << ADC_CCR_DMA_SHIFT) // 10: DMA mode 2 enabled
  // regval |= (3 << ADC_CCR_DMA_SHIFT) // 11: DMA mode 3 enabled

