WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // regval &= ~ADC_CCR_DELAY_MASK;    // 0000=5*Tadcclk (only used for dual/triple)
  // regval &= ~ADC_CCR_MULTI_MASK;    // Clear any bits
  // regval &= ~ADC_CCR_MULTI_NONE;     // 00000=Independent mode
  putreg32(regval, STM32_ADC_CCR);

  regval = getreg32(STM32_ADC_CCR);
  putreg32(regval, STM32_ADC_CCR);
  //---------------------------------------------------
  // Get the ADC Control Register 1 register. This register controls a lot of
  // options. I put the following in the same order as the Ref Man 15.13.2
  // This is mostly interrupt configuration
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);
  // regval &= ~ADC_CR1_OVRIE;       // 0=Disable Overrun interrupt
  //? regval &= ~ADC_CR1_RES_MASK;    // Insure all resolution bit are clear
  regval |= ADC_CR1_RES_12BIT;      // Set resolution 00=12, 01=10, 10=8 or 11=6 bits
  // regval |= ADC_CR1_AWDEN;       // Testing 0=Disable Analog watchdog on regular channels
  // regval &= ~ADC_CR1_JAWDEN;      // 0=Disable Analog watchdog on injected
  // regval &= ~ADC_CR1_JDISCEN;     // 0=Disable discontinuous mode on injected channels
  // regval &= ~ADC_CR1_DISCNUM_MASK;  // Set number of discontinuous channels to 1
  // regval &= ~ADC_CR1_DISCEN;      // 0=Disable discontinuous mode on regular channels
  // regval &= ~ADC_CR1_JAUTO;       // 0=Automatic Injected Group conversion
  // regval &= ~ADC_CR1_AWDSGL;      // 0=Disable watchdog on single channel in scan mode
  // [--] Since more than 1 ADC need to scan
  regval |= ADC_CR1_SCAN;           // 1=Scan mode (Scans channels in ADC_SQRx registers)
  // regval |= ADC_CR1_JEOCIE;      // 0=Disable interrupt for injected channels
  // regval |= ADC_CR1_AWDIE;       // 0=Analog Watchdog interrupt enable
  // regval |= ADC_CR1_EOCIE;       // 1=Enable interrupt for EOC
  // regval &= ~ADC_CR1_AWDCH_MASK;  // Clear the watchdog channel to 00000=Chan 0

  // Set for IN4 (PA4) while testing
  // (--) NOT NEEDED ??? regval |= (4 << ADC_CR1_AWDCH_SHIFT);  // 00100=Channel 4 analog watchdog select bits
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR1_OFFSET);

  //---------------------------------------------------
  // ADC CR2 Configuration
  // Note:fields not defined in header file have been ignored
  // Missing fields: SWSTART, EXTSEL, JSWSTART, JEXTEN, JEXTSEL, DDS & EOCS
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  //? regval &= ~ADC_CR2_EXTEN_MASK;  // Clear bits
  // regval |= ADC_CR2_EXTEN_NONE;   // No trigger from external sources
  regval &= ~ADC_CR2_ALIGN;       // 0=Right alignment (1=left alignment)
  // EOCS - End Of Conversion Selection. When should the EOC bit be set?
  regval |= ADC_CR2_EOCS;        // 1=End of each conversion, 0=End of sequence

#if ADC_TESTS_USE_DMA_TRANSFER > 0
#endif

  // Enable continous conversion
  regval |= ADC_CR2_CONT;         // 1=Enable continuous mode
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  //------------------------------------------------------------
  // ADC Sample Time Register - Determine how many clock cycles should each
  // conversion wait before beginning? See Ref Man sec 15.5.
  // With ADCCLK = 24MHz (see ADC_CCR_ADCPRE)
  // 000: 3 cycles Tconv = 3 + 12 = 15 cycles, 15/24,000,000 = 0.625 us
  // 001: 15 cycles
  // 010: 28 cycles
  // 011: 56 cycles
  // 100: 84 cycles
  // 101: 112 cycles Tconv = 112 + 12 = 124 cycles 124/24,000,000 = 4.667 us
  // 110: 144 cycles
  // 111: 480 cycles Tconv = 480 + 12 = 492 cycles 492/24,000,000 = 20.5 us
  // TESTING-Set all channels to the same default ADC_SMPR_DEFAULT
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SMPR1_OFFSET);
  // This #define will set all sample times to the same value. Here
  // ADC_SMPR_DEFAULTs are used to set ADC conversion the same.
  regval &= 0xf8000000;      // Clear Sample Time fields 10-18
  regval |= ADC_SMPR1_DEFAULT;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SMPR1_OFFSET);

  // Set sample time for channels 0-9
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SMPR2_OFFSET);
  regval &= 0xc0000000;      // Clear sample time fields 0-9
  regval |= ADC_SMPR2_DEFAULT;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SMPR2_OFFSET);

  //------------------------------------------------------------
  // ADC_SQR1, ADC_SQR2 and ADC_SQR3 are used to configure the sequence of the
  // conversions. If there are no entries then nothing will be converted.
  // Basically, which input in which order.
  //
  // The values put in this field are found by looking at the target hardware.
  // For the FeatherV2, A00 is PA4. Next look at the data sheet
  // 'Table 11. STM32F777xx, STM32F778Ax and STM32F779xx pin and ball
  // definitions.' In the 'Pin name' column find PA4. Then look in the
  // 'Additional functions' column for the possible analog inputs for the ADC
  // being used. In this case there are 2 possible ADC1_IN4, and ADC2_IN4.
  // Since for ADC1 the value is '4' (it's also 4 for ADC2 and 3).
  //
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);
  //? regval &= ADC_SQR3_RESERVED;   // Clear all SQR Bits
 
  // All 6 Pins available
  regval |= (4  << ADC_SQR3_SQ1_SHIFT);   // Channel 4  - A00 [PA4]->ADC123_IN4
  regval |= (5  << ADC_SQR3_SQ2_SHIFT);   // Channel 5  - A01 [PA5]->ADC123_IN5
  regval |= (3  << ADC_SQR3_SQ3_SHIFT);   // Channel 3  - A02 [PA3]->ADC123_IN3
  regval |= (8  << ADC_SQR3_SQ4_SHIFT);   // Channel 8  - A03 [PB0]->ADC12_IN8
  regval |= (9  << ADC_SQR3_SQ5_SHIFT);   // Channel 9  - A04 [PB1]->ADC12_IN9
  regval |= (10 << ADC_SQR3_SQ6_SHIFT);   // Channel 10 - A05 [PC0]->ADC123_IN10
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SQR3_OFFSET);

  // FOR TESTING - Hookup all 16 ADC Input and try to determine what's going
  // on
  // SQR3 has first 1 - 6 
  // regval |= (1  << ADC_SQR3_SQ1_SHIFT);   // Channel 1
  // regval |= (2  << ADC_SQR3_SQ2_SHIFT);   // Channel 2
  // regval |= (3  << ADC_SQR3_SQ3_SHIFT);   // Channel 3
  // regval |= (4  << ADC_SQR3_SQ4_SHIFT);   // Channel 4
  // regval |= (5  << ADC_SQR3_SQ5_SHIFT);   // Channel 5
  // regval |= (6  << ADC_SQR3_SQ6_SHIFT);   // Channel 6
  // putreg32(regval, baseADCAddr + STM32_ADC_SQR3_OFFSET);

  // // SQR2 has first 7 - 12
  // regval = getreg32(baseADCAddr + STM32_ADC_SQR2_OFFSET);
  // regval &= ADC_SQR2_RESERVED;            // Clear all SQR Bits
  // regval |= (7  << ADC_SQR2_SQ7_SHIFT);    // Channel 7
  // regval |= (8  << ADC_SQR2_SQ8_SHIFT);    // Channel 8
  // regval |= (9  << ADC_SQR2_SQ9_SHIFT);    // Channel 9
  // regval |= (10  << ADC_SQR2_SQ10_SHIFT);  // Channel 10
  // regval |= (11  << ADC_SQR2_SQ11_SHIFT);  // Channel 11
  // regval |= (12  << ADC_SQR2_SQ12_SHIFT);  // Channel 12
  // putreg32(regval, baseADCAddr + STM32_ADC_SQR2_OFFSET);

  // // And SQR1 has last 13 - 16 and the length (total conversions in sequence)
  // regval = getreg32(baseADCAddr + STM32_ADC_SQR1_OFFSET);
  // regval &= ADC_SQR1_RESERVED;            // Clear all SQR Bits
  // regval |= (13 << ADC_SQR1_SQ13_SHIFT);   // Channel 13
  // regval |= (14 << ADC_SQR1_SQ14_SHIFT);   // Channel 14
  // regval |= (15 << ADC_SQR1_SQ15_SHIFT);   // Channel 15
  // regval |= (16 << ADC_SQR1_SQ16_SHIFT);   // Channel 16
  // regval |= (15 << ADC_SQR1_L_SHIFT);      // A 15 will convert 16 inputs

  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_SQR1_OFFSET);
  //? regval &= ADC_SQR1_RESERVED;            // Clear all SQR Bits
  regval |= (5 << ADC_SQR1_L_SHIFT);       // A 5 will convert 6
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SQR1_OFFSET);

  // // Wake up internal temperature sensor
  // regval = getreg32(STM32_ADC_CCR);
  // regval |= ADC_CCR_TSVREFE;
  // putreg32(regval, STM32_ADC_CCR);

  // (--) WHY NOT WITH OTHER CR2 CONFIGS?
  // Enable DMA of ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  // DDS may only be for single ADC mode  (may be only when not using sequence???)
  // but comments 15.8.1 ony double buffered circular mode
  regval |= ADC_CR2_DDS;          // 1=Enable DMA Disable Selection
  regval |= ADC_CR2_DMA;          // 1=Enable DMA
  regval |= ADC_CR2_CONT;         // 1=Enable continuous mode
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
}
#endif

#if MEADOW_ADC_USE_NEW_CODE > 0
//================================================================
// Enable ADC
static void adc_enable(void)
{
  uint32_t regval;

