WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // Set ADON to turn on this ADC
  regval = getreg32(STM32_ADC1_CR2);
  regval |= ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_CR2);

  // Wait a bit
  usleep(400);
}
#else
//================================================================
// Enable ADC
static void adc_enable(void)
{
  uint32_t regval;

  // Set ADON to turn on this ADC
  regval = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_ADON;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);

  // Wait a bit
  usleep(400);
}
#endif

#if MEADOW_ADC_USE_NEW_CODE > 0
//================================================================
// Start ADC
static void adc_start(void)
{
  uint32_t regval;
  
  // Clear ADC Status register
  regval  = getreg32(STM32_ADC1_SR);
  regval = 0;
  putreg32(regval, STM32_ADC1_SR);

  // Start conversion
  regval  = getreg32(STM32_ADC1_CR2);
  regval |= ADC_CR2_SWSTART;
  putreg32(regval, STM32_ADC1_CR2);
}
#else
//================================================================
// Start ADC
static void adc_start(void)
{
  uint32_t regval;
  
  regval  = getreg32(STM32_ADC1_BASE + STM32_ADC_SR_OFFSET);
  regval = 0;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_SR_OFFSET);

  // Start conversion
  regval  = getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
  regval |= ADC_CR2_SWSTART;
  putreg32(regval, STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET);
}
#endif

#if MEADOW_ADC_USE_NEW_CODE > 0
//================================================================
// Initialize DMA
static void dma_initialize(void)
{
  uint32_t regval;

  // Using Nuttx DMA module to handle DMA setup
  // if(_dmaHandle != NULL)
  // {
  //   // Needed only if previous dma being modified.
  //   stm32_dmastop(_dmaHandle);
  //   stm32_dmafree(_dmaHandle); 
  // }

  _dmaHandle = stm32_dmachannel(DMAMAP_ADC1_1);

  // Configure the DMA SCR (Stream Control Register) values
  regval = getreg32(STM32_DMA2_S0CR);
  regval =  DMA_SCR_MSIZE_16BITS;   // Size of memory transfer
  regval |= DMA_SCR_PSIZE_16BITS;   // Size of peripheral transfer
  // Memory increment mode. 0=mem addr is fixed, 1=mem addr increments
  regval |= DMA_SCR_MINC;           // Mem Increment
  // (--) For one-shot operation CIRC isn't desired
  regval |= DMA_SCR_CIRC;           // Circular mode 1=enabled
  regval |= DMA_SCR_DIR_P2M;        // Direction 0=Perph->Mem

#if ADC_TESTS_USE_DOUBLE_BUFFERING > 0
  // For double-buffered add DMA_SCR_DBM to regval, the second buffer must be
  // follow the first in memory, so a double sized buffer is needed.
  // Internal to stm32_dmasetup() it sets the second buffer memory addr
  // based on the address of the one supplied + the buffer size.
  regval |= DMA_SCR_DBM;            // Double buffered mode
#endif

  // SxNDTR is set by Nuttx
  stm32_dmasetup(_dmaHandle,
                 STM32_ADC1_DR,                     // Peripheral data addr
                 (uint32_t)_dmaDataBuffer,         // Memory addr
                 ADC_TESTS_DMA_DATA_BUFFER_SIZE,    // number of transfers
                 regval);

  // Provide DMA callback
  // void *arg will be returned via callback to ISR
  // true/false for half buffer callback as well as full buffer.
  stm32_dmastart(_dmaHandle, adc_dma_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE, false);
}
#else
//================================================================
// Initialize DMA
static void dma_initialize(void)
{
  uint32_t regval;

// FOR DMA-SEEMS TO BE NO DIFFERENCE BETWEEN NUTTX AND DIRECT REGISTER VERSIONS
#if (1)   // Use Nuttx code
  // // Using Nuttx DMA module to handle DMA setup
  // if(_dmaHandle != NULL)
  // {
  //   // Needed only if previous dma being modified.
  //   stm32_dmastop(_dmaHandle);
  //   stm32_dmafree(_dmaHandle); 
  // }
  _dmaHandle = stm32_dmachannel(DMAMAP_ADC1_1);

  // Configure the DMA SCR (Stream Control Register) values
  regval = getreg32(STM32_DMA2_S0CR);
  regval =  DMA_SCR_MSIZE_16BITS;   // Size of memory transfer
  regval |= DMA_SCR_PSIZE_16BITS;   // Size of peripheral transfer
  // Memory increment mode. 0=mem addr is fixed, 1=mem addr increments
  regval |= DMA_SCR_MINC;           // Mem Increment
  regval |= DMA_SCR_CIRC;           // Circular mode 1=enabled
  regval |= DMA_SCR_DIR_P2M;        // Direction 0=Perph->Mem

#if ADC_TESTS_USE_DOUBLE_BUFFERING > 0
  // For double-buffered add DMA_SCR_DBM to regval, the second buffer must be
  // follow the first in memory, so a double sized buffer is needed.
  // Internal to stm32_dmasetup() it sets the second buffer memory addr
  // based on the address of the one supplied + the buffer size.
  regval |= DMA_SCR_DBM;            // Double buffered mode
#endif

  syslog(1, "--- meadow_adc.c - Address of buffer to DMA is:%p\n", _dmaDataBuffer);

  // SxNDTR is set by Nuttx
  stm32_dmasetup(_dmaHandle,
                 STM32_ADC1_BASE + STM32_ADC_DR_OFFSET, // Peripheral addr
                 (uint32_t)_dmaDataBuffer,          // Mem buffer addr
                 ADC_TESTS_DMA_DATA_BUFFER_SIZE,    // number of transfers
                 regval);

  // Provide DMA callback
  // void *arg will be returned via callback to DMA ISR
  // true/false for half buffer callback as well as full buffer.
  stm32_dmastart(_dmaHandle, adc_dma_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE, false);
#else
//------------------------------------------------------------
  // (--) PLAN B - Stop using Nuttx DMA code
  // Use direct register code
  // ADC1 DMA can be found here:DMA2, DMA_STREAM0, DMA_CHAN0
  // regval = getreg32(STM32_DMA2_S0CR);
  // regval &= ~DMA_SCR_EN;      // Clear the enable bit
  // putreg32(regval, STM32_DMA2_S0CR);

  // // Per Ref Man 8.3.18 must wait till 0
  // while ((getreg32(STM32_DMA2_S0CR) & DMA_SCR_EN) != 0);

  // Insure the DMA clock is on.
  regval = getreg32(STM32_RCC_APB1ENR);
  regval |= RCC_AHB1ENR_DMA2EN;
  putreg32(regval, STM32_RCC_APB1ENR);

  // Offset to DMA2 Stream 0 Control Register
  regval = getreg32(STM32_DMA2_S0CR);
  
  // Clear all the bits that can be set
  regval &= 0xe0000000;
  // NOT NEEDED HERE IT'S DONE BELOW
  putreg32(regval, STM32_DMA2_S0CR);

