WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // Select the Channel 0 by clearing (0000)
  // DIFFERENCE?? SAMPLE USES 0x7 DMA_SCR_CHSEL_MASK IS 0xf
  regval &= ~(7<<DMA_SCR_CHSEL_SHIFT);

  // (--) Trying Double-Buffer mode
  // The CT bit reveals which buffer is being filled
  // CT = 0 -> Memory 0
  // CT = 1 -> Memory 1  
  // regval |= DMA_SCR_DBM;
  // (--) Trying Double-Buffer mode
  // Set the memory size (MSIZE) is 16-bits 01
  // regval &= ~DMA_SCR_MSIZE_MASK;    // Clear both bits
  regval |= DMA_SCR_MSIZE_16BITS;   // Set size
  // Set the peripheral size (PSIZE) is 16-bits 01 
  // regval &= ~DMA_SCR_PSIZE_MASK;    // Clear both bits
  regval |= DMA_SCR_PSIZE_16BITS;   // Set size
  // Enable Memory Address Increment (MINC)
  // PINC is left 0 to not increment
  regval |= DMA_SCR_MINC;   // For 16-bit values incrementes by 2
  // Set Circular mode
  regval |= DMA_SCR_CIRC;
  // Set direction as Peripheral to Memory
  regval &= ~DMA_SCR_DIR_MASK;    // Clear both bits
  regval |= DMA_SCR_DIR_P2M;
  putreg32(regval, STM32_DMA2_S0CR);
  // Per Ref Man 8.3.18 must wait
  // while ((getreg32(STM32_ADC1_BASE + STM32_ADC_CR2_OFFSET) & ADC_CR2_ADON) != 0);

  // DMA2 Channel 0 Number of Data Transfer Register
  regval = getreg32(STM32_DMA2_S0NDTR);
  // regval &= ~0x0000ffff;      // Clear 15:0
  // // regval |= xferSize;
  regval = ADC_TESTS_DMA_DATA_BUFFER_SIZE;
  putreg32(regval, STM32_DMA2_S0NDTR);

  // DMA2 Channel 0 Peripheral Register
  regval = getreg32(STM32_DMA2_S0PAR);
  // regval = sourceAddr;
  regval = STM32_ADC1_BASE + STM32_ADC_DR_OFFSET;
  putreg32(regval, STM32_DMA2_S0PAR);

  // DMA2 Channel 0 Memory Address Register 0
  regval = (uint32_t)_dmaDataBufferHack;
  putreg32(regval, STM32_DMA2_S0M0AR);

#if ADC_TESTS_USE_DOUBLE_BUFFERING > 0
  // Setup alternate buffer's address
  // DMA2 Channel 0 Memory Address Register 1
  regval = _dmaDataBuffer2;
  putreg32(regval, STM32_DMA2_S0M1AR);
#endif

  // (--) CALLING DMA ISR NEED WORK-THE CODE TO ASSIGN THE ISR ISN'T WRITTEN
  // //       1/2 full         full          transfer err  Direct Mode err
  // regval = getreg32(STM32_DMA2_S0CR);
  // regval |= DMA_SCR_HTIE | DMA_SCR_TCIE | DMA_SCR_TEIE | DMA_SCR_DMEIE;
  // putreg32(regval, STM32_DMA2_S0CR);

  // Enable DMA Stream.
  regval = getreg32(STM32_DMA2_S0CR);
  regval |= DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

#endif    // #if ADC_TESTS_USE_DMA_TRANSFER > 0
}
#endif

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// Configure
// OPTION gpioList could require an 0xff terminator instead of gpioCount
// As few as 1 GPIO with 1 buffer element and as many as 16 GPIO with a buffer
// limit not specified.
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          uint16_t *dataBuffer, uint32_t convBuffSize)
{
  int ret;
  uint32_t gpioListOff;
  uint32_t mapOff;

  _gpioList = gpioList;
  _gpioCount = gpioCount;
 _dmaDataBuffer = dataBuffer;

  syslog(1, "--- meadow_adc - Address of buffer is:%p\n", _dmaDataBuffer);
  // syslog(1, "---meadow_adc configuration. gpioCount:%lu, convBufSize:%lu\n",
  //           gpioCount, convBuffSize);

  // Must have at least 1 entry per gpio
  if(gpioCount < convBuffSize)
  {
    syslog(1, "%s@%d-Error:gpioCount:%lu < convBuffSize:%lu\n",
              __FILE__, __LINE__, gpioCount, convBuffSize);
    return -EINVAL;   // Invalid argument
  }

  // Verify GPIO list is valid
  for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  {
    // Look for match
    for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
    {
      if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
        break;   // Found-it's connected to ADC
    }
  }

  // Did loop check all entries with no match?
  if(gpioListOff == gpioCount && mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
  {
    syslog(1, "%s@%d-Error:GPIO not found, gpioListOff:%lu, gpioCount:%lu, mapOff:%lu, MAP_LENGTH:%lu\n",
              __FILE__, __LINE__, gpioListOff, gpioCount,
              mapOff, MEADOW_ADC_GPIO_CHAN_MAP_LENGTH);
    return -EINVAL;   // Invalid argument
  }

  // Will the number of GPIOs exactly fill the provided buffer?
  if(gpioCount % convBuffSize != 0)
  {
    // Warning there will be empty array elements in the buffer after
    // conversion.
    syslog(1, "%s@%d-WARNING:buffer won't be completely filled\n",
                __FILE__, __LINE__);
  }

// (--) TO DO
  // How may cycles of conversion will fit in the provided data buffer

  // THIS MUST BE DONE BY THE CALLER IN NORMAL USE
  stm32_configgpio(GPIO_V2_A00_IN4_PA4);
  stm32_configgpio(GPIO_V2_A01_IN5_PA5);
  stm32_configgpio(GPIO_V2_A02_IN3_PA3);
  stm32_configgpio(GPIO_V2_A03_IN8_PB0);
  stm32_configgpio(GPIO_V2_A04_IN9_PB1);
  stm32_configgpio(GPIO_V2_A05_IN10_PC0);

#if ADC_TESTS_USE_DMA_TRANSFER > 0
  _dmaHandle = NULL;
#endif

  // Only after conversion has finished
  // sem_init(&_waitTillDoneSem, 0, 1);

syslog(1, "--- Attaching IRQ\n");
  // Setup the ADC Interrupt handler
  ret = irq_attach(STM32_IRQ_ADC, adc_conversion_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE);
  if(ret < 0)
  {
    syslog(1, "Error calling irq_attach\n");
  }
  
  adc_initialize();

  adc_enable();

  dma_initialize();

  // Start conversion
  adc_start();

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);

  syslog(1, "ADC initialization completed\n");
  return OK;
}

//==========================================================================
static void show_all_data_in_buffer(char *headerText, uint16_t dataBuffer[], uint32_t dataBufSize)
{
#define DMA_ISR_DISP_MAX_PER_ROW (8)    // 8 elements / row
#define DMA_ISR_DISP_VAL_LEN (5)        // Data values take 5 char
#define DMA_ISR_DISP_LEADER_LEN (9)     // Addr takes 9 chars

  uint32_t dmaBuffOff = 0;
  int columnCnt;
  int lineBuffOff;

  int disp_max_per_row = DMA_ISR_DISP_MAX_PER_ROW;
  if(disp_max_per_row > dataBufSize)
    disp_max_per_row = dataBufSize;

  int disp_char_per_row = (disp_max_per_row * DMA_ISR_DISP_VAL_LEN);
  int disp_total_line_len = disp_char_per_row + DMA_ISR_DISP_LEADER_LEN;
  char lineBuff[disp_total_line_len + 1];    // Room for NULL

  do
  {
    lineBuffOff = 0;
    snprintf(&lineBuff[lineBuffOff], disp_total_line_len, "%08x ", dmaBuffOff);
    lineBuffOff = DMA_ISR_DISP_LEADER_LEN;

    // Build a full row of data then print it
    for(columnCnt = 0; columnCnt < disp_max_per_row; columnCnt++)
    {
      snprintf(&lineBuff[lineBuffOff],
                disp_char_per_row - (columnCnt * DMA_ISR_DISP_VAL_LEN),
                "%04u ", dataBuffer[dmaBuffOff++]);
      lineBuffOff += DMA_ISR_DISP_VAL_LEN;
    }

    lineBuff[(lineBuffOff) + 1] = '\0';
    syslog(1, "%s-%s\n", headerText, lineBuff);

    // Line by line show entire buffer
  } while (dmaBuffOff < dataBufSize);
}

//=========================================================
// Convert
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_read_conversions(void)
{
  // Wait for conversion to finish
  // meadow_adc_buffer_takesem(&_waitTillDoneSem);
  show_all_data_in_buffer("Meadow ADC", _dmaDataBuffer, 6);

  return OK;
}



